
## Plan Result (account-delete-monitor-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/82280)


<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * aws_lambda_function.eventtracker_lambda_2D56166D


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_function.eventtracker_lambda_2D56166D will be updated in-place
  ~ resource "aws_lambda_function" "eventtracker_lambda_2D56166D" {
        id                             = "AccountDeleteMonitor-Prod-EventTracker-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:AccountDeleteMonitor-Prod-EventTracker-Function:433" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:AccountDeleteMonitor-Prod-EventTracker-Function:433/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "AccountDeleteMonitor"
        }
      ~ version                        = "433" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GIT_SHA"              = (sensitive value)
                # (4 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"868f6f90-0f93-4f28-8100-7d3d96db1273","JobName":"account-delete-monitor_infrastructure_plan_prod","PRNumber":281,"Program":"tfcmt","SHA1":"26e3063110eb2c56d9dcb104b2921f3215c3295b","Target":"account-delete-monitor-cdk","Vars":{}} -->